{
  "posts": [
    {
      "id": 1,
      "title": "Tried all type of drugs",
      "DateTime": "January 02, 2024 11:54:35 AM",
      "body": "Yes you can! I was and always will be an addict. I am a recovered drug addict and the worst kind. I did every drug that was available to me and if it wasn't available I found a way to get it. I shot up so much that I could no longer use any of my veins for iv drug use anymore and I hit my rock bottom and it's taken me years to get my health back. I'm happy to say that all veins are looking almost normal and I'm closest to the best shape I've ever been in besides when I was a teenager. It takes years to recover and get your body healthy and sometimes it's irreversible because you waited until it was to late. Diet and exercise and lots of water and vitamins. I actually used growth hormone to help heal damaged organs from my drug overdoses and drug use in general and it seemed to work wonders. Good luck and stay the course it's not worth the nightmare to get high and crash like a fuckin airplane."
    },
    {
      "id": 2,
      "title": "Hard Core drugs",
      "DateTime": "January 02, 2024 11:53:15 AM",
      "body": "I can say this, if the addict wants to stop they will stop. I personally had a relationship with most of the hardcore drugs! The first drug I ever did was meth. Ive completed a substance abuse treatment program, that I volunteered to go through. I say this with all seriousness, my drug of choice is Coca-Cola, not any of the traditional coke, meth or herion. The last time I got released from jail. I walked across the street and stole 2 coke from the gas station. This made me realize, you can be addicted to anything. However, what I did learn from the treatment progam is this. The addict has to change 3 things in their life, the people, the places and the things that they associate with their drug of choice. Also, recovery is lifelong process, the addict has to live day to day. Thank you for letting me share"
    },
    {
      "id": 3,
      "title": "Can you recover from a drug addiction, and how long does it take?",
      "DateTime": "January 02, 2024 11:25:13 AM",
      "body": "This answer will most likely not be a popular one, but popularity is not my goal here.\n\nMy goal is to tell you the straight truth about how to get clean, how to stop involving drugs in your thoughts and in your conversations with people day in and day out.\n\nMake sure that you want to quit more than you want to use. We use drugs not because we want to or because we enjoy them when we face the decision to quit. At that point we are using them because we are afraid to face a day without our mind altering substance. We are using them to escape reality and to just let life slip by while we are numb inside to pain, sadness and sadly true happiness as well. If you don't hate the drug you are addicted to you are not ready to quit. Don't waste your time, and don't get the hopes of your loved ones up. Just keep using until you know 100% you want to be free from the slavery you have volunteered yourself to\nNever, and I mean NEVER label yourself an addict. You are not going to ever be free from your slavery/addiction mind set if you call yourself an addict. Drugs will remain a part of your thought process and you will feel stigmatized and shame every time you allow yourself the crutch of saying you are an addict. You ARE a PERSON with strengths and weaknesses like every other person alive today. You ARE ADDICTED to a chemical that your body, or mind or both feels the need for to the point of not allowing life to intervene. However you are NOT an addict. The day you stop using drugs is the day you do battle with your addiction - no addict would ever battle their addiction would they?\nYou are NOT powerless against the drug. You were powerful enough to pick up the drug addiction and to carry it's weight until the day you quit. Addiction is fucking heavy. It wears on you. It makes you look and feel like shit. There is no joy without the drug only fear of running out. The money spent or the sex traded or the personal belongings no longer in your possession in order to obtain the drug consumes you. So to undo the damages you have caused yourself you had better be just as powerful. GUESS WHAT? You are absolutely powerful enough to quit. The only person that actually possesses the power to quit IS you. If you want to believe in a higher power go ahead, that is your choice. However do not believe the higher power will take your addiction away from you. He/She/It did not give you your addiction - YOU did. So YOU need to destroy the addiction with the same power you use to keep it alive. You are powerful and you need to believe that to succeed.\nRemove yourself from all things drug related. ALL things. All friends that you use with. If you use at your job, quit and find a better one you can't/wont use at. Or, at the very least take a leave of absence or vacation or whatever you can do for as long as possible. Does the person you love use drugs… leave them. The “love” you feel is not based in reality, you are both fucking high… it's not real. Family members use? Leave. Leave Leave LeaveLeaveLeave. The people that truly love you will understand. The people that don't understand are not there for you at all and will not have your best interests in mind. This is about YOU. This also means no meetings. Here come the 12 steppers, full of self righteous brain washed hate - I do battle with them all of the time. I simply tell them if they are in a 12 step program and if it works for them then stick with it. Just don't tell me that it will work for every single person on the planet facing up to and going to war with their addiction. It simply cannot and there is statistical evidence that it does not work for everyone. Again, if you are in a 12 step program and it is working, stay in it and work it and I sincerely hope you stay clean forever. We are both working for the same goal, this person's sobriety. People need to have choices to find what works for them. For me the meetings were all full of talking about…. DRUGS. I wanted no drug talk in my life at all. Going to meetings became something that worked against my goals and when i stopped going to meetings, i went to work, went home and relaxed, went outside and exercised, met people that didn't talk about drugs at all and drugs became a zero weight thought in my life and for THAT I thank God. And i know he smiles down on me for putting in the time and effort and not thinking i had some right to impose my will on what he should be doing for me.\nI recommend the book The Truth About Addiction and Recovery. For you and for anyone out there wishing the 12 step program was working for them, but it just isn't. One last time if you are in 12 step program and are healing and are recovering STICK WITH IT. I am not your enemy and I am not against the 12 steps for the people it works for… it just does not work for everyone and if it is not helping them it's hurting us all. Let those people have a path that may lead to recovery like I had. (12 years since my last meeting and 12 years without drugs in my life in any way shape or form until this answer… i hope it reaches someone and helps them) Isn't that more important than having the “right” way to being clean?\nGood luck and no matter what path you choose, a bad day without an Addiction is a million times better than a great day with one"
    }
  ]
}